# coding=utf-8

"""
坑：要用 Python 2
"""
import sys


def solve(val):
    """"""
    if val > 85000:
        ret = (3000 - 0) * 0.03 + (12000 - 3000) * 0.1 + (25000 - 12000) * 0.2 + (35000 - 25000) * 0.25 + (
                55000 - 35000) * 0.3 + (80000 - 55000) * 0.35 + (val - 85000) * 0.45
    if val > 60000:
        ret = (3000 - 0) * 0.03 + (12000 - 3000) * 0.1 + (25000 - 12000) * 0.2 + (35000 - 25000) * 0.25 + (
                55000 - 35000) * 0.3 + (val - 60000) * 0.35
    if val > 40000:
        ret = (3000 - 0) * 0.03 + (12000 - 3000) * 0.1 + (25000 - 12000) * 0.2 + (35000 - 25000) * 0.25 + (
                val - 40000) * 0.3
    if val > 30000:
        ret = (3000 - 0) * 0.03 + (12000 - 3000) * 0.1 + (25000 - 12000) * 0.2 + (val - 30000) * 0.25
    if val > 17000:
        ret = (3000 - 0) * 0.03 + (12000 - 3000) * 0.1 + (val - 17000) * 0.2
    if val > 8000:
        ret = (3000 - 0) * 0.03 + (val - 8000) * 0.1
    if val > 5000:
        ret = (val - 5000) * 0.03
    else:
        ret = 0

    return ret


if __name__ == "__main__":
    # 读取第一行的n
    n = int(sys.stdin.readline().strip())
    ans = 0
    for i in range(n):
        # 读取每一行
        val = int(sys.stdin.readline().strip())
        ret = solve(val)
        print(int(round(ret)))
